In [1]:
import pandas as pd

In [2]:
S1 = pd.Series([1,2,"A",3])
print(S1)

0    1
1    2
2    A
3    3
dtype: object

In [3]:
S1.values

array([1, 2, 'A', 3], dtype=object)

In [4]:
S1.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
S1 = pd.Series([1,2,"A",3,4,"B"])

In [38]:
a= pd.Series([1,2.2,"A","String"])
print(a)

0         1
1       2.2
2         A
3    String
dtype: object

In [40]:
a= pd.Series([1,2.2,"A","String"], ['a', 'b', 'c', 'd'])
print(a)

a         1
b       2.2
c         A
d    String
dtype: object

In [42]:
a= pd.Series([1,2.2,"A","String"], ['a', 'b', 'c', 'd'])
print(a)
print(a.index)

a         1
b       2.2
c         A
d    String
dtype: object
Index(['a', 'b', 'c', 'd'], dtype='object')

In [44]:
a= pd.Series([1,2.2,"A","String"], ['a', 'b', 'c', 'd'])
print(a)
print(a.index)
print(a[1])
print(a['b'])
a['b'] = 33.33
print(a[1])
print(a['b'])

a         1
b       2.2
c         A
d    String
dtype: object
Index(['a', 'b', 'c', 'd'], dtype='object')
2.2
2.2
33.33
33.33

C:\Users\USER\AppData\Local\Temp\ipykernel_34096\2358761639.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[1])
C:\Users\USER\AppData\Local\Temp\ipykernel_34096\2358761639.py:7: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[1])

In [46]:
import pandas as pd
import numpy as np

In [48]:
obj2 = pd.Series([4,7,-5,3], index =['d', 'b', 'a', 'c'])
display(obj2)
display(obj2.index)
display(obj2['a'])
obj2['d'] = 6
display(obj2[['c', 'a', 'd']])
display(obj2[obj2 > 0])
display(obj2 * 2)
np.exp(obj2)

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

-5

c    3
a   -5
d    6
dtype: int64

d    6
b    7
c    3
dtype: int64

d    12
b    14
a   -10
c     6
dtype: int64

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [50]:
obj = pd.Series([4,7,-5,'3', 'Ali'])
display(obj)

0      4
1      7
2     -5
3      3
4    Ali
dtype: object

In [52]:
obj * 2

0         8
1        14
2       -10
3        33
4    AliAli
dtype: object

In [54]:
'b' in obj2

True

In [56]:
'e' in obj2

False

In [58]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
display(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [60]:
states = ['Califonia', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

Califonia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
dtype: float64

In [62]:
pd.isnull(obj4)

Califonia     True
Ohio         False
Oregon       False
Texas        False
dtype: bool

In [64]:
pd.notnull(obj4)

Califonia    False
Ohio          True
Oregon        True
Texas         True
dtype: bool

In [66]:
obj3 + obj4

Califonia         NaN
Ohio          70000.0
Oregon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

In [68]:
#define a numeric series
s = pd.Series([100,200,54,67,300.12,400])
#print the unsorted series
print(s)
sorted_series = s.sort_values(ascending = True)
#print the sorted series
sorted_series

0    100.00
1    200.00
2     54.00
3     67.00
4    300.12
5    400.00
dtype: float64

2     54.00
3     67.00
0    100.00
1    200.00
4    300.12
5    400.00
dtype: float64

In [70]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
Califonia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
Name: population, dtype: float64

In [72]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [74]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [76]:
import numpy as np
import pandas as pd

In [78]:
series1 = pd.Series([6,7,8,9,10], index =['a','b','c','d','e'])
series2 = pd.Series(['Amy', 'Sam', 'Bill', 'Amanda', 'Ali'], index =['a','b','c','d','e'])

frame_from_series = pd.DataFrame({'Class': series1, 'Topper': series2})
frame_from_series

   Class  Topper
a      6     Amy
b      7     Sam
c      8    Bill
d      9  Amanda
e     10     Ali

In [80]:
list1 = [6,7,8,9,10]
list2 = ['Amy', 'Sam', 'Bill', 'Amanda', 'Greta']
pd.DataFrame([list1, list2])

     0    1     2       3      4
0    6    7     8       9     10
1  Amy  Sam  Bill  Amanda  Greta

In [82]:
pd.DataFrame({'Class':list1, 'Topper':list2})

   Class  Topper
0      6     Amy
1      7     Sam
2      8    Bill
3      9  Amanda
4     10   Greta

In [84]:
major_list = [[6, 'Amy'], [7, 'Sam'], [8, 'Bill'], [9, 'Amanda'], [10, 'Greta']]
pd.DataFrame(major_list, columns = ['Class', 'Topper'])

   Class  Topper
0      6     Amy
1      7     Sam
2      8    Bill
3      9  Amanda
4     10   Greta

In [86]:
final_frame = pd.DataFrame(
    {
        "Scalar_Data": 10,
        "DateRange": pd.date_range(start='1/1/2024', end = '1/05/2024'),
        "Series_Data": pd.Series([20,33,13,23,17], index = list(range(5)), dtype="float32"),
        "From_List":[100,200,300,400,500],
        "Categorical_Data": pd.Categorical(["This", "is", "Categorical", "column", "type"]),
        "Object_Data": ["If nothing", "is defined", "then it will", "be object", "for strings"]
    }
)
final_frame

,Scalar_Data,DateRange,Series_Data,From_List,Categorical_Data,Object_Data
0,10,2024-01-01,20.0,100,This,If nothing
1,10,2024-01-02,33.0,200,is,is defined
2,10,2024-01-03,13.0,300,Categorical,then it will
3,10,2024-01-04,23.0,400,column,be object
4,10,2024-01-05,17.0,500,type,for strings

In [88]:
data= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [90]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [91]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [94]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [96]:
data= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data, 
                     columns= ['year', 'state', 'pop'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [98]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop','debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [100]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [102]:
data= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2], 'debt': 16.6} 

frame2 = pd.DataFrame(data, 
                     columns= ['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.6
two    2001    Ohio  1.7  16.6
three  2002    Ohio  3.6  16.6
four   2001  Nevada  2.4  16.6
five   2002  Nevada  2.9  16.6
six    2003  Nevada  3.2  16.6

In [104]:
import pandas as pd
frame['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [106]:
frame['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [108]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt     16.6
Name: three, dtype: object

In [110]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [112]:
val = pd.Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [114]:
frame2['eastern'] = frame2.state =='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [116]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [118]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [120]:
#swap rows and columns
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [122]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [124]:
data= {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year':[2000,2001,2002,2001,2002,2003], 'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data, 
                     columns= ['year', 'state', 'pop'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
frame

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9
six    2003  Nevada  3.2

In [126]:
frame.index.name = 'Numbers'
frame.columns.name =' My States'
frame

 My States  year   state  pop
Numbers
one         2000    Ohio  1.5
two         2001    Ohio  1.7
three       2002    Ohio  3.6
four        2001  Nevada  2.4
five        2002  Nevada  2.9
six         2003  Nevada  3.2

In [128]:
import pandas as pd
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [130]:
index[1:]

Index(['b', 'c'], dtype='object')

In [132]:
import numpy as np
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [134]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [136]:
obj2.index is labels

True

In [138]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index= ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [140]:
obj3 = pd.Series(['blue','purple','yellow'], index= [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [142]:
obj3.reindex(range(6), method= 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [146]:
df= pd.DataFrame({"A":[None,1,2,3,None, None],
                  "B":[11,5,None, None,None,8],
                  "C":[None,5,10,11,None,8]})
print(df)

     A     B     C
0  NaN  11.0   NaN
1  1.0   5.0   5.0
2  2.0   NaN  10.0
3  3.0   NaN  11.0
4  NaN   NaN   NaN
5  NaN   8.0   8.0

In [148]:
print(df.ffill(axis=0))

     A     B     C
0  NaN  11.0   NaN
1  1.0   5.0   5.0
2  2.0   5.0  10.0
3  3.0   5.0  11.0
4  3.0   5.0  11.0
5  3.0   8.0   8.0

In [150]:
print(df.bfill(axis=0))

     A     B     C
0  1.0  11.0   5.0
1  1.0   5.0   5.0
2  2.0   8.0  10.0
3  3.0   8.0  11.0
4  NaN   8.0   8.0
5  NaN   8.0   8.0

In [249]:
frame =pd.DataFrame(np.arange(9).reshape((3,3)),
index=['a','c','d'],
columns=['Ohio', 'Texas', 'Califonia'])
frame

   Ohio  Texas  Califonia
a     0      1          2
c     3      4          5
d     6      7          8

In [245]:
frame =pd.DataFrame(np.arange(9).reshape((3,3)),
index=['a','c','d'],
columns=['Ohio', 'Texas', 'Califonia'])
frame2= frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  Califonia
a   0.0    1.0        2.0
b   NaN    NaN        NaN
c   3.0    4.0        5.0
d   6.0    7.0        8.0

In [168]:
obj = pd.Series(np.arange(5.), index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [170]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [172]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [237]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=['Ohio', 'Colorado','Utah','New York'],
                  columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [239]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [241]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [243]:
data.drop(['two','four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [186]:
obj=pd.Series(np.arange(4), index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [192]:
obj['b']
obj[1]
obj[2:4]
obj[['b','a','d']]
obj[[1,3]]
obj[obj < 2]

C:\Users\USER\AppData\Local\Temp\ipykernel_34096\2443231624.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]
C:\Users\USER\AppData\Local\Temp\ipykernel_34096\2443231624.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

a    0
b    1
dtype: int32

In [202]:
#with labels it is up until and including, with index it is up until and not including
print(obj['b':'d'])
print(obj[1:3])

b    1
c    2
d    3
dtype: int32
b    1
c    2
dtype: int32

In [7]:
import pandas as pd
import numpy as np
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio', 'Colorado','Utah','New York'],
                    columns=['one', 'two', 'three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [225]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [227]:
display(data.loc['Colorado': 'Utah', ['two', 'three']])

          two  three
Colorado    5      6
Utah        9     10

In [ ]:
#what can you do to slice this instead of using the loc and iloc function
display(data.loc['Colorado': 'Utah', ['two', 'three']])

In [229]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [231]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [235]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [9]:
display (data.iloc[:, :3][data.three > 5])

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [11]:
display (data.iloc[:, :2][data.three > 6])

          one  two
Utah        8    9
New York   12   13

In [25]:
import pandas as pd
import numpy as np
ser2 = pd.Series(np.arange(3), index=['a','b','c'])
display(ser2)
display(ser2[-3])

a    0
b    1
c    2
dtype: int32

C:\Users\USER\AppData\Local\Temp\ipykernel_3884\1858762682.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  display(ser2[-3])

0

In [27]:
ser3 = pd.Series(np.arange(3, ), index=[-1,-2,-3])
display(ser3)
ser3[-3]

-1    0
-2    1
-3    2
dtype: int32

2

In [52]:
s1=pd.Series([7.3, -2.5, 3.4, 1.5], index=['a','c','d','e'])
display(s1)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [54]:
s2=pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a','c','e','f','g'])
display(s2)

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [56]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [32]:
df1= pd.DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                  index= ['Ohio', 'Texas', 'Colorado'])
display(df1)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [34]:
df2= pd.DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
display(df2)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [36]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [60]:
df1 =pd.DataFrame({'A': [1,2]})
df2 =pd.DataFrame({'B': [3,4]})
display(df1)
display(df2)
df1-df2

   A
0  1
1  2

   B
0  3
1  4

    A   B
0 NaN NaN
1 NaN NaN

In [66]:
df1= pd.DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2= pd.DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
df2.loc[1, 'b']=np.nan
display(df1)
display(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [68]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [70]:
#another method to add is to use the add() function
display(df1.add(df2))

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [74]:
#the fill_value is to substitute missing data in the dataframe
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [82]:
obj= pd.Series(range(4), index=['d','a','b','c'])
obj.sort_index()
frame =pd.DataFrame(np.arange(8).reshape((2,4)), index=['three','one'], 
                    columns=['d','a','b','c'])
display(frame)
display(frame.sort_index())
display(frame.sort_index(axis=1))

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [88]:
frame.sort_index(axis=1, ascending=False)
display(frame.sort_index(axis=1, ascending=False))

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

obj=pd.Series([4,7,-3,2])
display(obj)
obj.sort_values()

In [92]:
obj=pd.Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [94]:
frame=pd.DataFrame({'b': [4,7,-3,2], 'a': [0,1,0,1]})
display(frame)
frame.sort_values(by='b')

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [106]:
#ranking
sr= pd.Series([10,25,3,11,24,6], index= ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp'])
display(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
dtype: int64

In [112]:
#ranking is done according to the smallest number
result=sr.rank()
display(result)

Coca Cola    3.0
Sprite       6.0
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
dtype: float64

In [114]:
sr= pd.Series([10,25,3,11,24,6,25], index= ['Coca Cola', 'Sprite', 'Coke', 'Fanta', 'Dew', 'ThumbsUp', 'Apply'])
display(sr)

Coca Cola    10
Sprite       25
Coke          3
Fanta        11
Dew          24
ThumbsUp      6
Apply        25
dtype: int64

In [116]:
result=sr.rank()
display(result)

Coca Cola    3.0
Sprite       6.5
Coke         1.0
Fanta        4.0
Dew          5.0
ThumbsUp     2.0
Apply        6.5
dtype: float64

In [127]:
frame=pd.DataFrame({'b': [4.3,7,-3,2], 'a': [0,1,0,1], 'c': [-2,5,8,-2.5]})
display(frame)
display(frame.rank(axis='columns'))
display(frame.rank(axis='rows'))
display(frame.rank(axis='rows', method='first'))

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

     b    a    c
0  3.0  1.0  2.0
1  4.0  3.0  3.0
2  1.0  2.0  4.0
3  2.0  4.0  1.0

In [131]:
obj=pd.Series(range(5), index=['a','a','b','b','c'])
display(obj)

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [133]:
obj['a']

a    0
a    1
dtype: int64

In [137]:
obj['c']

4

In [139]:
df=pd.DataFrame([[1.4, np.nan],
                 [7.1, -4.5],
                 [np.nan, np.nan],
                 [0.75, -1.3]],
                index=['a','b','c','d'], columns=['one','two'])
display(df)
display(df.sum(axis=0))
display(df.sum(axis=1))

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [145]:
df=pd.DataFrame({"A":[12,4,5, None, 1],
                 "B":[7,2,54,3,None],
                 "C":[20,16,11,3,8],
                 "D":[14,3,None,2,6]})
display(df)
#skip the null vales while findng the mean
df.mean(axis=1, skipna= True)

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

In [147]:
df.mean(axis=0, skipna= True)

A     5.50
B    16.50
C    11.60
D     6.25
dtype: float64

In [151]:
obj=pd.Series(['a','a','b','c'] *4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [159]:
obj=pd.Series(['c','a','d','a','a','b','b','c','c'])
obj.value_counts()
display(obj)

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [161]:
pd.value_counts(obj.values, sort=False)

C:\Users\USER\AppData\Local\Temp\ipykernel_3884\3084372382.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64